app/views/questions/_form.html.erb

SELECT "categories".* FROM "categories"
---
<p><%= f.label :category %></p>
<%= f.select 'category_id', options_from_collection_for_select(Category.all, 'id', 'name')%>