app/controllers/answers_controller.rb

INSERT INTO "answers" ("question_id", "user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 1], ["user_id", 2], ["text", "lol\r\n"], ["created_at", "2018-02-20 20:33:29.090069"], ["updated_at", "2018-02-20 20:33:29.090069"]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "count" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["count", 1], ["updated_at", "2018-02-20 20:33:29.298408"], ["id", 1]]
SELECT "chosen_questions".* FROM "chosen_questions" WHERE "chosen_questions"."question_id" = ?  [["question_id", 2]]
INSERT INTO "notifications" ("user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["text", "На питання 'cool' була додана нова відповідь"], ["created_at", "2018-02-23 21:04:01.438056"], ["updated_at", "2018-02-23 21:04:01.438056"]]
---
	def create
		params[:answer][:user_id]=current_user.id
		params[:answer][:question_id]=params[:question_id]
		@answer=Answer.create(answer_params)
		if @answer.save
			@question=Question.find(@answer.question.id)
			@question.update(count: @question.count+1)

			@chosens=ChosenQuestion.where(question_id: @question.id)
			@chosens.each do |chosen|
				@notification=Notification.create(user_id: chosen.user.id, text: "На питання '"+@question.name+"' була додана нова відповідь")

SELECT  "answer_votes".* FROM "answer_votes" WHERE "answer_votes"."user_id" = ? AND "answer_votes"."answer_id" = ? ORDER BY "answer_votes"."id" ASC LIMIT ?  [["user_id", 2], ["answer_id", 1], ["LIMIT", 1]]
INSERT INTO "answer_votes" ("user_id", "answer_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["answer_id", 1], ["score", 1], ["created_at", "2018-02-20 20:33:32.304284"], ["updated_at", "2018-02-20 20:33:32.304284"]]
UPDATE "answer_votes" SET "score" = ?, "updated_at" = ? WHERE "answer_votes"."id" = ?  [["score", 1], ["updated_at", "2018-02-20 20:33:43.512632"], ["id", 1]]
UPDATE "answers" SET "scores" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["scores", 1], ["updated_at", "2018-02-20 20:33:32.408098"], ["id", 1]]
SELECT SUM("answer_votes"."score") FROM "answer_votes" WHERE "answer_votes"."answer_id" = 1
---
	def positiv_vote
		@vote=AnswerVote.where(user_id: current_user.id,answer_id: @answer.id).first
		if @vote==nil
		    @vote=AnswerVote.create(user_id: current_user.id, answer_id: @answer.id, score: 1)
	    else
	    	if @vote.score == -1
	    	    @vote.update(score: 1)
	        end
	    end
	    @answer.update(scores: AnswerVote.where(answer: @answer.id).sum(:score))

SELECT  "answer_votes".* FROM "answer_votes" WHERE "answer_votes"."user_id" = ? AND "answer_votes"."answer_id" = ? ORDER BY "answer_votes"."id" ASC LIMIT ?  [["user_id", 2], ["answer_id", 1], ["LIMIT", 1]]
UPDATE "answer_votes" SET "score" = ?, "updated_at" = ? WHERE "answer_votes"."id" = ?  [["score", -1], ["updated_at", "2018-02-20 20:33:39.304006"], ["id", 1]]
UPDATE "answers" SET "scores" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["scores", -1], ["updated_at", "2018-02-20 20:33:39.405434"], ["id", 1]]
SELECT SUM("answer_votes"."score") FROM "answer_votes" WHERE "answer_votes"."answer_id" = 1
---
	def negativ_vote
		@vote=AnswerVote.where(user_id: current_user.id,answer_id: @answer.id).first
		if @vote==nil
		    @vote=AnswerVote.create(user_id: current_user.id, answer_id: @answer.id, score: -1)
	    else
	    	if @vote.score == 1
	    	    @vote.update(score:-1)
	        end
	    end
	    @answer.update(scores: AnswerVote.where(answer: @answer.id).sum(:score))