app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."category_id" = ?  [["category_id", 1]]
---
	def show
		@category=Category.find(params[:id])
		@questions=Question.where(category_id: @category.id)