app/controllers/questions_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY "answers"."scores" DESC  [["question_id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "chosen_questions".* FROM "chosen_questions" WHERE "chosen_questions"."user_id" = ? AND "chosen_questions"."question_id" = ? ORDER BY "chosen_questions"."id" ASC LIMIT ?  [["user_id", 2], ["question_id", 2], ["LIMIT", 1]]
---
	def show
		@answers=Answer.where(question_id: @question.id).order(scores: :DESC)
		@anscomments=[];
		@answers.each do |answer|
			@anscomments[answer.id]=Anscomment.where(answer_id: answer.id)
		end
		if current_user != nil
			@chosen=ChosenQuestion.where(user_id: current_user.id, question_id: @question.id).first

INSERT INTO "questions" ("name", "text", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "kuk"], ["text", "kak"], ["category_id", 2], ["user_id", 2], ["created_at", "2018-02-20 20:33:24.225444"], ["updated_at", "2018-02-20 20:33:24.225444"]]
INSERT INTO "notifications" ("user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["text", "Ваше питання успішно додано Тут повинно бути посилання"], ["created_at", "2018-02-23 20:58:26.263097"], ["updated_at", "2018-02-23 20:58:26.263097"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "categories" SET "count" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["count", 1], ["updated_at", "2018-02-20 20:33:24.372704"], ["id", 2]]
---
	def create
		params[:question][:user_id]=current_user.id
		@question=Question.create(question_params)
		if @question.save
			chosen
			@notification=Notification.create(user_id: current_user.id, text: "Ваше питання успішно додано")
			@category=Category.find(@question.category.id)
			@category.update(count: @category.count+1)

SELECT  "chosen_questions".* FROM "chosen_questions" WHERE "chosen_questions"."question_id" = ? ORDER BY "chosen_questions"."id" ASC LIMIT ?  [["question_id", 1], ["LIMIT", 1]]
INSERT INTO "chosen_questions" ("user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["question_id", 1], ["created_at", "2018-02-25 19:34:05.854289"], ["updated_at", "2018-02-25 19:34:05.854289"]]
---
	def chosen
		@chosen=ChosenQuestion.where(question_id: @question.id).first
		if @chosen == nil
			@chosen=ChosenQuestion.create(user_id: current_user.id,question_id: @question.id)